# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# import random

# # n = int(input())
# # list_1 = [random.randint(0,10) for _ in range(n)]
# # list_1 = [1, 1, 2, 0, -1, 3, 4, 4]
# # print(list_1.count(1))                             !!!!!!!!!!!!!!!!!!!!!!!!!!семинар - метод count

# print(len(set(list_1)))                             !!!!!!!!!!!!!!!!!!!!!!!!!!семинар - простое решение

# count = 0
# list_1 = [1, 1, 2, 0, -1, 3, 4, 4]
# list_2 = []
# for i in list_1:
#     if i not in list_2:
#         list_2.append(i)
# print(len(list_2))



# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 2
# Output: [4, 5, 1, 2, 3]

# list = [1, 2, 3, 4, 5]
# k = 23
# k = k % len(list)
# for i in range(k):
#     b = list.pop()
#     print(b)
    # list.insert(0, b)                    //insert в неужное место, а аppend в конец
# print(list)

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Задача №21. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# clovar = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# set1 = set()
# for i in clovar:
#     print(i)
#     for j in i:
#         set1.add(i[j])
# print (set1)








# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Задача №23. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)































